25deg/sna/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    outlet
    {
        type            patch;
        nFaces          16;
        startFace       592;
    }
    outdoors
    {
        type            symmetryPlane;
        nFaces          192;
        startFace       608;
    }
    floor
    {
        type            wall;
        nFaces          128;
        startFace       800;
    }
    inlet
    {
        type            patch;
        nFaces          16;
        startFace       928;
    }

)

// ************************************************************************* //
